# Feature Transformation 
1) Normalization
2)Stadardization
3)Robust Scalar
4)Max Absolute Scalar

In [1]:
import pandas as pd
df = pd.read_csv('supershops.csv')

In [2]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [3]:
df1 = df.copy()
df3 = df.copy()
df2 = df.copy()

# Freature Engineering: Normalization

In [4]:
from sklearn.preprocessing import MinMaxScaler
#https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MinMaxScaler.html

In [5]:
minmax = MinMaxScaler() # feature_range=(0,1) #default
# minmax = MinMaxScaler(fearture_range=(5,10)

In [6]:
scaled_1st = minmax.fit(df[['Marketing Spend']]) # training

In [7]:
scaled_1st

MinMaxScaler()

In [8]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [9]:
df['Marketing Spend'] = minmax.transform(df[['Marketing Spend']])

In [10]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [12]:
df['Administration'] = minmax.fit_transform(df[['Administration']])

In [13]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [14]:
df['Transport'] = minmax.fit_transform(df[['Transport']])

In [15]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744   1.000000    Dhaka  192261.83
1         0.983359        0.761972   0.940893      Ctg  191792.06
2         0.927985        0.379579   0.864664  Rangpur  191050.39
3         0.873136        0.512998   0.812235    Dhaka  182901.99
4         0.859438        0.305328   0.776136  Rangpur  166187.94

# Freature Engineering: Standardization

In [16]:

df2.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Manually using formulla:

In [18]:
df2['New Marketing Spend'] = (df2['Marketing Spend'] - df2['Marketing Spend'].mean())/df2['Marketing Spend'].std()

In [20]:
df2.head()

,Marketing Spend,Administration,Transport,Area,Profit,New Marketing Spend
0,114523.61,136897.80,471784.10,Dhaka,192261.83,0.888889
1,162597.70,151377.59,443898.53,Ctg,191792.06,1.936203
2,153441.51,101145.55,407934.54,Rangpur,191050.39,1.736731
3,144372.41,118671.85,383199.62,Dhaka,182901.99,1.539157
4,142107.34,91391.77,366168.42,Rangpur,166187.94,1.489812

In [21]:
df2['New Marketing Spend'].std()

1.0

In [22]:
df2['New Marketing Spend'].mean()

2.7977620220553945e-16

# Using library :

In [23]:
# https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html
from sklearn.preprocessing import StandardScaler
std = StandardScaler()

In [24]:
df2['Administration'] = std.fit_transform(df[['Administration']])

In [26]:
df2.head()

,Marketing Spend,Administration,Transport,Area,Profit,New Marketing Spend
0,114523.61,0.560753,471784.10,Dhaka,192261.83,0.888889
1,162597.70,1.082807,443898.53,Ctg,191792.06,1.936203
2,153441.51,-0.728257,407934.54,Rangpur,191050.39,1.736731
3,144372.41,-0.096365,383199.62,Dhaka,182901.99,1.539157
4,142107.34,-1.079919,366168.42,Rangpur,166187.94,1.489812

In [27]:
df2['Marketing Spend'] = std.fit_transform(df[['Marketing Spend']])

In [28]:
df2.head()

,Marketing Spend,Administration,Transport,Area,Profit,New Marketing Spend
0,0.897913,0.560753,471784.10,Dhaka,192261.83,0.888889
1,1.955860,1.082807,443898.53,Ctg,191792.06,1.936203
2,1.754364,-0.728257,407934.54,Rangpur,191050.39,1.736731
3,1.554784,-0.096365,383199.62,Dhaka,182901.99,1.539157
4,1.504937,-1.079919,366168.42,Rangpur,166187.94,1.489812

# Freature Engineering: Max Absulate Scalar

In [29]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Manually using Formula

In [30]:
df3['Marketing Spend'].max()

165349.2

In [31]:
df3['Marketing Spend'] = df3['Marketing Spend']/df3['Marketing Spend'].max()

In [32]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

# Using pythone library

In [33]:
from sklearn.preprocessing import MaxAbsScaler
scaler = MaxAbsScaler()

In [34]:
df3['Administration'] = scaler.fit_transform(df3[['Administration']])

In [35]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527  471784.10    Dhaka  192261.83
1         0.983359        0.828805  443898.53      Ctg  191792.06
2         0.927985        0.553781  407934.54  Rangpur  191050.39
3         0.873136        0.649738  383199.62    Dhaka  182901.99
4         0.859438        0.500378  366168.42  Rangpur  166187.94

# Freature Engineering: Robust Scalar

In [36]:
from sklearn.preprocessing import RobustScaler
RoSc=RobustScaler()

In [37]:
df3['Transport'] = RoSc.fit_transform(df3[['Transport']])

In [38]:
df3.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.749527   1.552016    Dhaka  192261.83
1         0.983359        0.828805   1.383714      Ctg  191792.06
2         0.927985        0.553781   1.166654  Rangpur  191050.39
3         0.873136        0.649738   1.017368    Dhaka  182901.99
4         0.859438        0.500378   0.914576  Rangpur  166187.94